opendj-sdk/opends/tests/functional-tests/shared/data/dsml/suites/04addmodaddsuite/data/add185.dat

POST /dsml HTTP/1.1
Host: Foo
Connection: Close
Content-Length: 1414
SOAPAction: "#batchRequest"

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
    <soap-env:Body>
      <batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core">
        <modifyRequest dn="uid=ejohnson, ou=people, o=dsmlfe.com">
        <modification name="pager" operation="add">
        <value>+1 999 555 1212</value>
        </modification>
        </modifyRequest>
        <modifyRequest dn="uid=prigden, ou=people, o=dsmlfe.com">
        <modification name="pager" operation="add">
        <value>+1 999 555 1212</value>
        </modification>
        </modifyRequest>
        <modifyRequest dn="uid=bwalker, ou=people, o=dsmlfe.com">
        <modification name="pager" operation="add">
        <value>+1 999 555 1212</value>
        </modification>
        </modifyRequest>
        <modifyRequest dn="uid=kjensen, ou=people, o=dsmlfe.com">
        <modification name="pager" operation="add">
        <value>+1 999 555 1212</value>
        </modification>
        </modifyRequest>
        <modifyRequest dn="uid=mlott, ou=people, o=dsmlfe.com">
        <modification name="pager" operation="add">
        <value>+1 999 555 1212</value>
        </modification>
        </modifyRequest>
      </batchRequest>
    </soap-env:Body>
  </soap-env:Envelope>
